void setup(){
  size(650,800); 
  background(255);
  fill(0);
  PFont fonta;
  fonta=createFont("標楷體", 32);
  
  textFont(fonta, 12);
  text("檔    號:", 480, 50);
  text("保存年限:", 480, 62);
  textFont(fonta, 26);
  text("行政院農業委員會動植物防疫檢疫局  函", 80, 90);
  textFont(fonta, 12);
  text("地址:100臺北市重慶南路二段", 410, 110);
  text("51號9樓", 410, 122);
  text("電話:(02)3343-6426", 410, 134);
  text("傳真:(02)2392-2496", 410, 146);
  text("電子信箱:", 410, 158);
  text("承辦人:王文賢", 410, 170);
  
  textFont(fonta, 20);
  text("受文者:教育部", 50, 190);
  textFont(fonta, 12);
  text("發文日期:中華民國102年08月08日", 50, 215);
  text("發文字號:防檢一字第1020224272號", 50, 229);
  text("速別:普通件", 50, 243);
  text("密等及解密條件或保密期限:", 50, 257);
  text("附件:", 50, 271);
  
  textFont(fonta, 20);
  text("主旨:因應野生動物狂犬病疫情，本局製造衛教宣導海報、宣導", 50, 295);
  text("小卡片提供予各縣市政府，由其發送各國中、小學，請查", 100, 320);
  text("照。", 100, 345);
  text("說明:", 50, 370);
  text("一、依據行政院農業委員會交下102年7月19日教育部臺教綜(", 70, 395);
  text("五)字第1020111169號函辦理。", 110, 420);
  text("二、有關狂犬病相關宣導資料，可至本局網頁「狂犬病專區」", 70, 445);
  text(" 「宣導資料」項下，「文宣海報」下載使用。", 170, 495); 
  textFont(fonta, 18);
  text("(http://www.baphiq.gov.tw/news_list.php?menu=1924&type", 110, 470);
  text("id=1939)", 110, 495);
  
  textFont(fonta, 12);
  text("正本:教育部", 50, 520);
  text("副本:行政院農業委員會、本局局長室、趙副局長室、動物防疫組", 50, 540);
  text("102/08/08", 50, 558);
  text("16:38:35", 51, 570);
  text("第一頁 共一頁", 300, 750);
  line(50, 548, 105, 548);
  line(50, 572, 105, 572);
  line(50, 548, 50, 572);
  line(105, 548, 105, 572);
  
  for(int i=0; i<220;i++){
    point(25,62+i*3);
  }  
  text("裝" , 20, 250);
  text("訂" , 20, 400);
  text("線" , 20, 550);
}
