PGraphics p;
void setup(){
  size(300,300,P2D);
  PFont fonta;
  fonta=createFont("標楷體", 32);
  p=createGraphics(14000,4000,JAVA2D);
  p.beginDraw();
    p.strokeWeight(10);
    p.background(255);
    p.line(500,3500,p.width,3500);
    
    for(int i=0;i<27;i++){
      p.line(500+i*500,3400,500+i*500,3600); 
    }
    
    p.fill(0);
    p.textFont(fonta, 150);
    for(int i=0;i<14;i++){
      p.text((i+97)+"年",500+i*1000,3800); 
    }
    int n[]={20,20,26,32,36,37,41,40,35,37,33,71,71,83,91,81,82,89,89,88};
    for(int i=0;i<20;i++){
      p.text(n[i],(i+2)*500,1200);  
    }
    
    p.noStroke();
    p.fill(200);
    for(int i=0;i<20;i++){
      p.rect(800+i*500,3500-n[i]*21,400,n[i]*20); 
    }  
    
    p.fill(0);
    p.text("學童數",300,1200);
    p.text("福德國小",300,3300);
    p.text("西湖國中",300,3100);
    p.text("獅潭國中",300,2900);
    p.text("南湖國中",6.7*500,2700);
    p.text("大湖國中",9.7*500,2500);
    p.text("東明國中",9.7*500,2300);
    p.text("美群國中",9.7*500,2100);
    p.text("南和國中",11.7*500,1900);
    p.text("成功國中",17.7*500,1700);  
    
    p.fill(94,38,18,200);
    p.rect(2*500,3200,21*500,100);
    p.fill(85,107,47,200);
    p.rect(2*500,3000,8*500,100);
    p.fill(0,100,0,200);
    p.rect(2*500,2800,6*500,100);
    p.fill(34,139,34,200);
    p.rect(8*500,2600,15*500,100);
    p.fill(70,130,180,200);
    p.rect(11*500,2400,12*500,100);
    p.fill(25,25,112,200);
    p.rect(11*500,2200,12*500,100);
    p.fill(0,0,128,200);
    p.rect(11*500,2000,2*500,100);
    p.fill(85,26,139,200);
    p.rect(13*500,1800,2*500,100);
    p.fill(139,28,98,200);
    p.rect(19*500,1600,4*500,100);
  p.endDraw();
  p.save("big.png");
}
